//==========================homework=========================//

// 1- Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('введіть число')
// if (x !== 0) {
//     document.write('Вірно')
// } else{
//     document.write('Невірно')
// }

// 2 -Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt('введіть число від 0 до 59');
// if (time <= 15 && time >= 1){
//     document.write('число попадає до 1 четверті')
// }else if (time > 15 && time <= 30){
//     document.write('число попадає до 2 четверті')
// }else if (time > 30 && time <= 45){
//     document.write('число попадає до 3 четверті')
// }else if (time > 45 && time <= 59){
//     document.write('число попадає до 4 четверті')
// }else {
//     document.write('ви ввели щось не те')
// }

//3 - У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('введіть число дня від 1 до 31')
// if (day > 1 && day <= 10  ){
//     document.write('це день з 1 декади')
// }else if (day > 10 && day <= 20){
//     document.write('це день з 2 декади')
// }else if (day > 20 && day <= 31) {
//     document.write('це день з 3 декади')
// }else {
//     document.write('ви ввели щось не те')
// }

//4 - Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день
// (можна замість плану на день, назву дня англійською).
// switch (prompt('введіть день тижня')) {
//     case 'понеділок':
//         document.write('піти в школу');
//         break;
//     case 'вівторок':
//         document.write('погуляти з собакою');
//         break;
//     case 'середа':
//         document.write('покататись на скейті');
//         break;
//     case 'четверг':
//         document.write('позайматись програмуванням');
//         break;
//     case 'пятниця ':
//         document.write('прибирання');
//         break;
//     case 'субота':
//         document.write('позайматись спортом');
//         break;
//     case 'неділя':
//         document.write('повчити англійську');
//         break;
//     default:
//         document.write('ви ввели щось не те')
// }

// 5 - Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
// let first_num = prompt('введіть 1 число');
// let second_num = prompt('введіть 2 число');
// if (first_num > second_num){
//  document.write(first_num)
// }else if(second_num > first_num){
//  document.write(second_num)
// }else {
//  document.write('error')
// }

// 6 - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно).
// Напишіть код який,за допомоги  оператора || буде присвоювати змінній х значення "default"
// якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
let x = !10;
let b = x || 'default';
console.log(b)

