// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

 let time = prompt("Введіть хвилину від 0 до 59");
 if (time >= 0 && time <= 14) {
    console.log('Перша чверть')
 } else if (time >= 15 && time <= 29) {
     console.log('Друга чверть')
 } else if (time >= 30 && time <= 44) {
     console.log('Третя чверть')
 }else if (time >= 45 && time <= 59) {
    console.log('Четверта чверть')
 } else {
     console.log("Нeправельно введені дані")
 }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

 let day = prompt("Введіть число місяця");
 if (day >= 1 && day <= 10) {
     console.log('Перша третина')
 } else if (day >= 11 && day <= 20) {
     console.log('Друга третина')
 } else if (day >= 21 && day <= 31) {
     console.log('Третя третина')
 } else {
     console.log("Некоректно введені дані")
 }

// - У нас є змінна test яка дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = '';
 if (test === true) {
     console.log('ВІРНО')
 } else {
     console.log('НЕВІРНО')
 }


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

 let number = prompt('Введіть число 1, 0 , -3');
 if (number !== 0){
     console.log('ВІРНО')
 } else {
     console.log('НЕВІРНО')
 }


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

 let Week = prompt('Введіть день тижня від 1 до 7')
switch (Week) {
   case 1:
       console.log('ПОНЕДІЛОК: піти на роботу');
        break;
     case 2:
        console.log('ВІВТОРОК: піти в зал');
      break;
    case 3:
        console.log('СЕРЕДА:заправити машину ');
        break;
     case 4:
        console.log('ЧЕТВЕР: сходити в магазин');
        break;
    case 5:
        console.log('ПЯТНИЦЯ: вигуляти собаку');
        break;
    case 6:
         console.log('СУБОТА: прибрати вдома');
         break;
     case 7:
        console.log('НЕДІЛЯ: відпочивати');
         break;
     default:
         console.log("неправельно введені данні");
 }


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

 let oficialName = prompt('Яка «офіційна» назва JavaScript?');
 if(oficialName === 'ECMAScript'){
   alert('Правильно');
 } else{
  alert('Неправильно, офіційна назва - ECMAScript!');
 }
