//Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3 ){
    console.log('це великий масив')
}else if (friends < 3) {
    console.log('це малий масив')
}
//===================================================ТЕРНАРКА==============================================//
(prompt('введіть число') >= 3) ? console.log('це великий масив') : console.log('це малий масив')


// //- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// // Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let number1 = 1;
// let number2 = 2;
// let number3 = 3;
// if ( number1 < number2 && number2 < number3){
//    alert('number2 посередині')
// }


//- Перепишіть конструкцію if з використанням умовного оператора '?':

// let result;
// let a = 1;
// let b = 2;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//    result = 'Багато';
// }
//
// let result;
// let a = 1;
// let b = 1;
// (a + b < 4) ? result = 'мало' : result = 'багато';
// alert(result);